USE mydeal;

INSERT INTO `projects` (`user_id`, `projects`) VALUES 
(1,	'Входящие'),
(1,	'Учеба'),
(1,	'Работа'),
(1,	'Домашние дела'),
(1,	'Авто'),
(2,	'Университет'),
(2,	'Работа'),
(2,	'Семья');

INSERT INTO `tasks` (`user_id`, `project_id`, `date_create`, `status`, `name`, `file`, `srok`) VALUES 
(1,	1, '2020-10-31 11:54:48', 0, 'Встреча', NULL, '2020-11-10'),
(1,	1, '2020-11-04 11:54:48', 0, 'Доставка', NULL, '2020-11-13'),
(1,	2, '2020-11-06 11:54:48', 0, 'Лабортаорка по ИП', NULL, '2020-11-14'),
(1,	3, '2020-11-07 11:54:48', 0, 'Зарплата', NULL, '2020-11-15'),
(1,	4, '2020-11-08 11:54:48', 0, 'Перебрать кладовку', NULL, '2020-11-18'),
(1,	5, '2020-11-09 11:54:48', 0, 'Поменять колесо', NULL, '2020-11-16'),
(2,	6, '2020-11-05 11:54:48', 0, 'Курсач', NULL, '2020-11-13'),
(2,	7, '2020-11-07 11:54:48', 0, 'Закончить проект', NULL, '2020-11-12'),
(2,	7, '2020-11-10 11:54:48', 0, 'Позвонить начальнику', NULL, '2020-11-14');


INSERT INTO `users` (`date`, `email`, `name`, `password`) VALUES 
('2020-10-27 11:54:48', 'test1@mail.ru','Вася', MD5('123')),
('2020-10-25 11:54:48', 'test2@mail.ru','Петр', MD5('12345mydealmydeal'));

/*получить список из всех проектов для одного пользователя;*/
SELECT `projects` FROM `projects` WHERE `user_id`=2;

/*получить список из всех задач для одного проекта;*/
SELECT * FROM `tasks` WHERE `project_id`=7;

/*пометить задачу как выполненную*/
UPDATE `tasks` SET `status`=1 WHERE `id`=2;

/*обновить название задачи по её идентификатору.*/
UPDATE `tasks` SET `name`='Лабортаорка по ИП Важно!!!' WHERE `id`=3;